// Сравните циклы с использованием операторов for и while в двух предыдущих заданиях.
// Каковы преимущества и недостатки каждого из них в разные случаи?

// for loop удобен когда у нас точно известно начало и конец. Нет необходимости во внешних
// переменнах для счетчика цикла и нет необходимости следить за увеличением или уменьшением
// счетчика в конце каждой итерации
// Недостатки for loop: относятся больше к построению сложной логики в условии, и все таки 
// for loop больше предназначен для итерирования через конечные коллекции

// while loop удобен для ситуаций, когда нужно останавливать цикл по условию, вне зависимости 
// от достижения конца вычислений
// Главный недостаток в while loop, что если его использовать в качестве цикла со счетчиком,
// то есть вероятность забыл проинициализировать начальным значением счетчик, и забыть выполнить
// действия по уменьшению или увеличению счетчика в конце каждой итерации